# <font color="blue">Python Pandas - DataFrame</font>

In [2]:
import pandas as pd
data = [1,2,3,4,5,6]
df = pd.DataFrame(data)
df

   0
0  1
1  2
2  3
3  4
4  5
5  6

In [21]:
data = [['Rabbani', 50],["Raj", 501], ['Habib', 1907]]
df = pd.DataFrame(data, columns = ['Name', 'ID'], dtype=float)
df

      Name      ID
0  Rabbani    50.0
1      Raj   501.0
2    Habib  1907.0

In [19]:
data ={
    'Name':["x", 'y', 'z', 'm'],
    'roll': [10,50,10,13]
}
df = pd.DataFrame(data)
df

  Name  roll
0    x    10
1    y    50
2    z    10
3    m    13

In [30]:
data = {
    'Name': ['a', 'b', 'c', 'd', 'e', 'f'],
    'Taka': [1000, 2000, 2500, 15400, 44521, 1452]
}

df = pd.DataFrame(data)
df.head(3)

  Name  Taka
0    a  1000
1    b  2000
2    c  2500

In [29]:
df.tail(1)

  Name  Taka
5    f  1452

In [31]:
df

  Name   Taka
0    a   1000
1    b   2000
2    c   2500
3    d  15400
4    e  44521
5    f   1452

In [3]:
data = {
    'Name':['x', 'y', 'z', 'p', 'q', 'w'],
    'Age': [10, 52, 36, 40, 25, 12]
}
df = pd.DataFrame(data, index=['R1', 'R2','R3', 'R4', 'R5', 'R6'])
df

   Name  Age
R1    x   10
R2    y   52
R3    z   36
R4    p   40
R5    q   25
R6    w   12

In [34]:
new_df = pd.DataFrame(data, index=[101, 201, 301, 401, 501, 601])
new_df

    Name  Age
101    x   10
201    y   52
301    z   36
401    p   40
501    q   25
601    w   12

In [39]:
data = [{'a':201, 'b': 250, 'c': 120}, {'a': 1230, 'e': 452, 'f': 154}] # list of dict
df = pd.DataFrame(data)
df

      a      b      c      e      f
0   201  250.0  120.0    NaN    NaN
1  1230    NaN    NaN  452.0  154.0

In [41]:
data = [{'a':1, 'b':2}, {'a':5, 'b':10, 'c':20}]
df1 = pd.DataFrame(data, index=['first', 'second'], columns = ['a','b'])
df1

        a   b
first   1   2
second  5  10

In [42]:
df2 = pd.DataFrame(data, index=['first', 'second'], columns=['a', 'b1'])
df2

        a  b1
first   1 NaN
second  5 NaN

In [43]:
df3 = pd.DataFrame(data, index=['first', 'second'], columns=['a', 'c'])
df3

        a     c
first   1   NaN
second  5  20.0

In [48]:
df1.columns

Index(['a', 'b'], dtype='object')

In [49]:
df['a']

0     201
1    1230
Name: a, dtype: int64

In [3]:
df.describe

<bound method NDFrame.describe of    0
0  1
1  2
2  3
3  4
4  5
5  6>